# Aula 2 - Data Science

In [7]:
url = "https://drive.google.com/uc?id=1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT"

In [10]:
import pandas as pd
import csv as csv

df = pd.read_csv(url)

In [20]:
df

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0           0    Escola A     Publica           2917          1910635
1           1    Escola B     Publica           2949          1884411
2           2    Escola C  Particular           1761          1056600
3           3    Escola D     Publica           4635          3022020
4           4    Escola E  Particular           1468           917500
5           5    Escola F  Particular           2283          1319574
6           6    Escola G  Particular           1858          1081356
7           7    Escola H     Publica           4976          3124928
8           8    Escola I  Particular            427           248087
9           9    Escola J  Particular            962           585858
10         10    Escola K  Particular           1800          1049400
11         11    Escola L     Publica           3999          2547363
12         12    Escola M     Publica           4761          3094650
13         13    Escola N     Publica           2739          1763916
14         14    Escola O  Particular           1635          1043130

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_Escola        15 non-null     int64
 1   Nome_Escola      15 non-null     object
 2   Tipo_Escola      15 non-null     object
 3   Numero_Alunos    15 non-null     int64
 4   Orcamento_Anual  15 non-null     int64
dtypes: int64(3), object(2)
memory usage: 732.0+ bytes

In [18]:
df['Numero_Alunos'] * 2

0     2917
1     2949
2     1761
3     4635
4     1468
5     2283
6     1858
7     4976
8      427
9      962
10    1800
11    3999
12    4761
13    2739
14    1635
Name: Numero_Alunos, dtype: int64

In [ ]:
df.isnull()

ID_Escola          0
Nome_Escola        0
Tipo_Escola        0
Numero_Alunos      0
Orcamento_Anual    0
dtype: int64

In [ ]:
df.isnull().sum()

In [ ]:
df.isna()

    ID_Escola  Nome_Escola  Tipo_Escola  Numero_Alunos  Orcamento_Anual
0       False        False        False          False            False
1       False        False        False          False            False
2       False        False        False          False            False
3       False        False        False          False            False
4       False        False        False          False            False
5       False        False        False          False            False
6       False        False        False          False            False
7       False        False        False          False            False
8       False        False        False          False            False
9       False        False        False          False            False
10      False        False        False          False            False
11      False        False        False          False            False
12      False        False        False          False            False
13      False        False        False          False            False
14      False        False        False          False            False

In [ ]:
df.isna().sum()

In [27]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [22]:
df.duplicated().sum()

np.int64(0)

In [31]:
df[df.duplicated() == True]

Empty DataFrame
Columns: [ID_Escola, Nome_Escola, Tipo_Escola, Numero_Alunos, Orcamento_Anual]
Index: []

In [32]:
df.describe()

       ID_Escola  Numero_Alunos  Orcamento_Anual
count  15.000000      15.000000     1.500000e+01
mean    7.000000    2611.333333     1.643295e+06
std     4.472136    1420.915282     9.347763e+05
min     0.000000     427.000000     2.480870e+05
25%     3.500000    1698.000000     1.046265e+06
50%     7.000000    2283.000000     1.319574e+06
75%    10.500000    3474.000000     2.228999e+06
max    14.000000    4976.000000     3.124928e+06

In [35]:
df.describe(include=['O'])

       Nome_Escola Tipo_Escola
count           15          15
unique          15           2
top       Escola A  Particular
freq             1           8

In [38]:
pd.set_option('display.float_format', '{:.2f}' .format)
df.describe()

       ID_Escola  Numero_Alunos  Orcamento_Anual
count      15.00          15.00            15.00
mean        7.00        2611.33       1643295.20
std         4.47        1420.92        934776.29
min         0.00         427.00        248087.00
25%         3.50        1698.00       1046265.00
50%         7.00        2283.00       1319574.00
75%        10.50        3474.00       2228999.00
max        14.00        4976.00       3124928.00

In [45]:
quantitativas = ['Numero_Alunos', 'Orcamento_Anual']
df[quantitativas].describe()

       Numero_Alunos  Orcamento_Anual
count          15.00            15.00
mean         2611.33       1643295.20
std          1420.92        934776.29
min           427.00        248087.00
25%          1698.00       1046265.00
50%          2283.00       1319574.00
75%          3474.00       2228999.00
max          4976.00       3124928.00

In [46]:
qualitativas = ['Nome_Escola', 'Tipo_Escola']
df[qualitativas].describe()

       Nome_Escola Tipo_Escola
count           15          15
unique          15           2
top       Escola A  Particular
freq             1           8